create table reagent_table
(
	id int auto_increment comment '订单ID
',
	reagent_id int not null comment '试剂ID',
	reagent_name varchar(20) not null comment '试剂名称
',
	reagent_purity varchar(10) null comment '试剂纯度',
	reagent_content varchar(8) null comment '试剂含量',
	reagent_density varchar(15) null comment '试剂密度',
	reagent_danger varchar(10) null comment '试剂危险',
	reagent_weight varchar(10) null comment '试剂重量
',
	reagent_price varchar(10) null comment '试剂单价',
	manufacturer varchar(15) null comment '生产厂家',
	supplier_name varchar(15) null comment '供货商家',
	supplier_phone varchar(16) null comment '商家电话',
	order_type varchar(10) null comment '订单类型',
	image_1 varchar(200) null comment '动态图像1',
	image_2 varchar(200) null comment '动态图像2',
	image_3 varchar(200) null comment '动态图像3',
	QR_image varchar(200) null comment '试剂二维码',
	constraint reagent_table_pk
		primary key (id)
)
comment '试剂订单';

insert into reagent_schema.reagent_table (id, reagent_id, reagent_name, reagent_purity, reagent_content, reagent_density, reagent_danger, reagent_weight, reagent_price, manufacturer, supplier_name, supplier_phone, order_type, image1, image2, image3, QR_image, create_time, update_time, operator_id, operator_name, equipment_id)
values  (1, 15235, 'test', '92.5%', '80ml', '10g/ml', '一级易爆', '40g', '500.5', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-22 00:00:00', '2021-03-22 00:00:00', 1, '张三', 1),
		(2, 12533, 'test2', '87.5%', '67ml', '22.5g/ml', '二级易爆', '60g', '478.5', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 22:40:28', '2021-03-24 22:40:33', 2, '李四', 1),
		(3, 15323, 'test3', '79.4%', '69ml', '12.0g/ml', '二级易爆', '63g', '418.5', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 20:40:28', '2021-03-24 22:40:33', 2, '李四', 1),
		(4, 34522, 'test4', '57.5%', '17ml', '24.0g/ml', '二级易爆', '36g', '278.5', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 19:35:31', '2021-03-24 22:40:33', 2, '李四', 1),
		(5, 25512, 'test5', '82.4%', '267ml', '21.0g/ml', '二级易爆', '126g', '41.6', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 15:46:33', '2021-03-24 22:40:33', 2, '李四', 1),
		(6, 15343, 'test6', '84.5%', '674ml', '23.4g/ml', '二级易爆', '346g', '53.23', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-26 23:33:28', '2021-03-24 22:40:33', 2, '李四', 1),
		(7, 25512, 'test5', '82.4%', '267ml', '21.0g/ml', '二级易爆', '126g', '41.6', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 15:46:33', '2021-03-24 22:40:33', 2, '李四', 1),
		(8, 25512, 'test5', '82.4%', '267ml', '21.0g/ml', '二级易爆', '126g', '41.6', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 15:46:33', '2021-03-24 22:40:33', 2, '李四', 1),
		(9, 15343, 'test6', '84.5%', '674ml', '23.4g/ml', '二级易爆', '346g', '53.23', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-26 23:33:28', '2021-03-24 22:40:33', 2, '李四', 1),
		(10, 25512, 'test5', '82.4%', '267ml', '21.0g/ml', '二级易爆', '126g', '41.6', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 15:46:33', '2021-03-24 22:40:33', 2, '李四', 1),
		(11, 34522, 'test4', '57.5%', '17ml', '24.0g/ml', '二级易爆', '36g', '278.5', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 19:35:31', '2021-03-24 22:40:33', 2, '李四', 1),
		(12, 15323, 'test3', '79.4%', '69ml', '12.0g/ml', '二级易爆', '63g', '418.5', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 20:40:28', '2021-03-24 22:40:33', 2, '李四', 1),
		(13, 12533, 'test2', '87.5%', '67ml', '22.5g/ml', '二级易爆', '60g', '478.5', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 22:40:28', '2021-03-24 22:40:33', 2, '李四', 1),
		(14, 25512, 'test5', '82.4%', '267ml', '21.0g/ml', '二级易爆', '126g', '41.6', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 15:46:33', '2021-03-24 22:40:33', 2, '李四', 1),
		(15, 34522, 'test4', '57.5%', '17ml', '24.0g/ml', '二级易爆', '36g', '278.5', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 19:35:31', '2021-03-24 22:40:33', 2, '李四', 1),
		(16, 25512, 'test5', '82.4%', '267ml', '21.0g/ml', '二级易爆', '126g', '41.6', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 15:46:33', '2021-03-24 22:40:33', 2, '李四', 1),
		(17, 15323, 'test3', '79.4%', '69ml', '12.0g/ml', '二级易爆', '63g', '418.5', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 20:40:28', '2021-03-24 22:40:33', 2, '李四', 1),
		(18, 12533, 'test2', '87.5%', '67ml', '22.5g/ml', '二级易爆', '60g', '478.5', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 22:40:28', '2021-03-24 22:40:33', 2, '李四', 1),
		(19, 34522, 'test4', '57.5%', '17ml', '24.0g/ml', '二级易爆', '36g', '278.5', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 19:35:31', '2021-03-24 22:40:33', 2, '李四', 1),
		(20, 15323, 'test3', '79.4%', '69ml', '12.0g/ml', '二级易爆', '63g', '418.5', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 20:40:28', '2021-03-24 22:40:33', 2, '李四', 1),
		(21, 34522, 'test4', '57.5%', '17ml', '24.0g/ml', '二级易爆', '36g', '278.5', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 19:35:31', '2021-03-24 22:40:33', 2, '李四', 1),
		(22, 25512, 'test5', '82.4%', '267ml', '21.0g/ml', '二级易爆', '126g', '41.6', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 15:46:33', '2021-03-24 22:40:33', 2, '李四', 1),
		(23, 25512, 'test5', '82.4%', '267ml', '21.0g/ml', '二级易爆', '126g', '41.6', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 15:46:33', '2021-03-24 22:40:33', 2, '李四', 1),
		(24, 34522, 'test4', '57.5%', '17ml', '24.0g/ml', '二级易爆', '36g', '278.5', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 19:35:31', '2021-03-24 22:40:33', 2, '李四', 1),
		(25, 15323, 'test3', '79.4%', '69ml', '12.0g/ml', '二级易爆', '63g', '418.5', '海口试剂公司', '海口商店', '17330919733', '原有库存订单', '4.jpg', '5.jpg', '6.jpg', 'qr2.jpg', '2021-03-24 20:40:28', '2021-03-24 22:40:33', 2, '李四', 1);
